<a href="https://colab.research.google.com/github/tonia-3/wk-3-IP/blob/main/IP_wk3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

####MTN COTE-D'IVOIRE PROJECT

In [ ]:
#importing the cell geo dataset
url ='/content/cells_geo.csv'
df_cells = pd.read_csv(url,delimiter=';', header =1, names = ['City','Status','Locality','Geographical_Zone','Zone_Name','Longitude','Latitude','Region','Area','Cell_ID','Site_ID'])

df_cells.head()

      City      Status   Locality  ... Area     Cell_ID     Site_ID
1   ADJAME  In Service    ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2   ADJAME  In Service    ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17
3  ASSINIE  In Service  INTERIEUR  ...  NaN  69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service  INTERIEUR  ...  NaN  7a1029d2ab  8a1e6ce31f
5  ASSINIE  In Service  INTERIEUR  ...  NaN  0b4f56438f  8a1e6ce31f

[5 rows x 11 columns]

In [4]:
#importing CDR 20120507
url ='/content/Telcom_dataset.csv'
df_07 = pd.read_csv(url,header =0, names = ['Product','Value','Date_Time','Cell_On_Site','Party_A_Number','Party_B_Number','Country_A','Country_B','Cell_ID','Site_ID'])
df_07.head()

  Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [5]:
#importing CDR 20120508
url = '/content/Telcom_dataset2.csv'
df_08 = pd.read_csv(url,header =1, names = ['Product','Value','Date_Time','Cell_On_Site','Party_A_Number','Party_B_Number','Country_A','Country_B','Cell_ID','Site_ID'])
df_08.head()

  Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
0   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
2   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
3     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO
4     sms      0  2012-05-07 23:05:41.0  ...     19e2e  /MMplBlWjh  /MMplBlWjh

[5 rows x 10 columns]

In [6]:
#importing CDR 20120509
url ='/content/Telcom_dataset3.csv'
df_09 = pd.read_csv(url, header =1, names = ['Product','Value','Date_Time','Cell_On_Site','Party_A_Number','Party_B_Number','Country_A','Country_B','Cell_ID','Site_ID'])
df_09.head()

  Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
0     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
1   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
2     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
3   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA
4   Voice     10  2012-05-08 23:03:59.0  ...     19e2e  +e+xcimwre  +e+xcimwre

[5 rows x 10 columns]

In [7]:
#Dataframe information 
print(df_cells.info())
print(df_cells.describe())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3973 entries, 1 to 3973
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   City               3973 non-null   object
 1   Status             3906 non-null   object
 2   Locality           3973 non-null   object
 3   Geographical_Zone  3973 non-null   object
 4   Zone_Name          3967 non-null   object
 5   Longitude          3973 non-null   float64
 6   Latitude           3973 non-null   float64
 7   Region             3973 non-null   object
 8   Area               3951 non-null   object
 9   Cell_ID            3973 non-null   object
 10  Site_ID            3973 non-null   object
dtypes: float64(2), object(9)
memory usage: 372.5+ KB
None
         Longitude     Latitude
count  3973.000000  3973.000000
mean     -4.877880     6.244970
std       1.300861     1.304289
min      -8.503889     0.000000
25%      -5.846139     5.338639
50%      -4.084500     5.475000
75%      -3.993444     6.872306
max      -0.000000    10.481861

In [8]:
#the unique values in the cells of geographical data
print ("Unique Locality ", df_cells.Locality.nunique(), " out of " , df_cells.Locality.count())
print ("Unique Area ", df_cells.Area.nunique(), " out of " , df_cells.Area.count())
print ("Unique Geographical_Zone ", df_cells.Geographical_Zone.nunique(), " out of " , df_cells.Geographical_Zone.count())
print ("Unique Region ", df_cells.Region.nunique(), " out of " , df_cells.Region.count())
print ("Unique Zone_Name ", df_cells.Zone_Name.nunique(), " out of " , df_cells.Zone_Name.count())
print ("Unique cities ", df_cells.City.nunique(), " out of " , df_cells.City.count())
print ("Unique Site_Id ", df_cells.Site_ID.nunique(), " out of " , df_cells.Site_ID.count())
print ("Unique Cell_ID ", df_cells.Cell_ID.nunique(), " out of " , df_cells.Cell_ID.count())

Unique Locality  2  out of  3973
Unique Area  6  out of  3951
Unique Geographical_Zone  15  out of  3973
Unique Region  19  out of  3973
Unique Zone_Name  33  out of  3967
Unique cities  504  out of  3973
Unique Site_Id  1029  out of  3973
Unique Cell_ID  3915  out of  3973

In [9]:
#checking the status
list(df_cells.Status.unique())

['In Service', nan]

In [10]:
#checking the null values
print(df_cells.isnull().sum())

City                  0
Status               67
Locality              0
Geographical_Zone     0
Zone_Name             6
Longitude             0
Latitude              0
Region                0
Area                 22
Cell_ID               0
Site_ID               0
dtype: int64

In [11]:
#checking the CDR 07 dataframe information including the null values, descriptive analysis and geographical information
print("Cells Geographic Information")
print(df_07.info())
print("Cells Descriptive Statistics")
print(df_07.describe())
print("Null Values in Cells Dataset")
print(df_07.isnull().sum())

Cells Geographic Information
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5001 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product         5001 non-null   object
 1   Value           5001 non-null   int64
 2   Date_Time       5001 non-null   object
 3   Cell_On_Site    5001 non-null   object
 4   Party_A_Number  5001 non-null   object
 5   Party_B_Number  5001 non-null   object
 6   Country_A       5001 non-null   object
 7   Country_B       5001 non-null   object
 8   Cell_ID         5001 non-null   object
 9   Site_ID         4285 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB
None
Cells Descriptive Statistics
             Value
count  5001.000000
mean     25.869626
std     101.934502
min       0.000000
25%       0.000000
50%       0.000000
75%      25.000000
max    4440.000000
Null Values in Cells Dataset
Product             0
Value               0
Date_Time           0
Cell_On_Site        0
Party_A_Number      0
Party_B_Number      0
Country_A           0
Country_B           0
Cell_ID             0
Site_ID           716
dtype: int64

In [13]:
#checking the CDR 08 information including the geo info descriptive analysis and null values
print("08 CDR Geographic Information")
print(df_08.info())
print("08 CDR Descriptive Statistics")
print(df_08.describe())
print("Null Values in 08 CDR Dataset")
print(df_08.isnull().sum())

08 CDR Geographic Information
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product         5000 non-null   object
 1   Value           5000 non-null   int64
 2   Date_Time       5000 non-null   object
 3   Cell_On_Site    5000 non-null   object
 4   Party_A_Number  5000 non-null   object
 5   Party_B_Number  5000 non-null   object
 6   Country_A       5000 non-null   object
 7   Country_B       5000 non-null   object
 8   Cell_ID         5000 non-null   object
 9   Site_ID         4324 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB
None
08 CDR Descriptive Statistics
             Value
count  5000.000000
mean     24.339800
std      97.480726
min       0.000000
25%       0.000000
50%       0.000000
75%      25.000000
max    3380.000000
Null Values in 08 CDR Dataset
Product             0
Value               0
Date_Time           0
Cell_On_Site        0
Party_A_Number      0
Party_B_Number      0
Country_A           0
Country_B           0
Cell_ID             0
Site_ID           676
dtype: int64

In [14]:
#checkinf the CDR09 information including the geo info, descriptive analysis and null values
print("09 CDR Geographic Information")
print(df_09.info())
print("09 CDR Descriptive Statistics")
print(df_09.describe())
print("Null Values in 09 CDR Dataset")
print(df_09.isnull().sum())

09 CDR Geographic Information
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product         5000 non-null   object
 1   Value           5000 non-null   int64
 2   Date_Time       5000 non-null   object
 3   Cell_On_Site    5000 non-null   object
 4   Party_A_Number  5000 non-null   object
 5   Party_B_Number  5000 non-null   object
 6   Country_A       5000 non-null   object
 7   Country_B       5000 non-null   object
 8   Cell_ID         5000 non-null   object
 9   Site_ID         4395 non-null   object
dtypes: int64(1), object(9)
memory usage: 390.8+ KB
None
09 CDR Descriptive Statistics
              Value
count   5000.000000
mean      26.434600
std      224.222108
min        0.000000
25%        0.000000
50%        0.000000
75%       25.000000
max    12900.000000
Null Values in 09 CDR Dataset
Product             0
Value               0
Date_Time           0
Cell_On_Site        0
Party_A_Number      0
Party_B_Number      0
Country_A           0
Country_B           0
Cell_ID             0
Site_ID           605
dtype: int64

In [15]:
#getting the unique values of the 07 dataset
print("07 Dataset")
print ("Unique Country_A ", df_07.Country_A.nunique(), " out of " , df_07.Country_A.count())
print ("Unique Country_B ", df_07.Country_B.nunique(), " out of " , df_07.Country_B.count())
print ("Unique Product ",   df_07.Product.nunique(),   " out of " , df_07.Product.count())
print ("Unique Cell_On_Site ", df_07.Cell_On_Site.nunique(), " out of " , df_07.Cell_On_Site.count())
print ("Unique Site_ID ", df_07.Site_ID.nunique(), " out of " , df_07.Site_ID.count())
print ("Unique Cell_ID ", df_07.Cell_ID.nunique(), " out of " , df_07.Cell_ID.count())
print ("Unique Party_A_Number ", df_07.Party_A_Number.nunique(), " out of " , df_07.Party_A_Number.count())
print ("Unique Party_B_Number ", df_07.Party_B_Number.nunique(), " out of " , df_07.Party_B_Number.count())

07 Dataset
Unique Country_A  1  out of  5001
Unique Country_B  2  out of  5001
Unique Product  3  out of  5001
Unique Cell_On_Site  7  out of  5001
Unique Site_ID  1076  out of  4285
Unique Cell_ID  1790  out of  5001
Unique Party_A_Number  3903  out of  5001
Unique Party_B_Number  2848  out of  5001

In [16]:
#getting the unique values of the 08 dataset
print("08 Dataset")
print ("Unique Country_A ", df_08.Country_A.nunique(), " out of " , df_08.Country_A.count())
print ("Unique Country_B ", df_08.Country_B.nunique(), " out of " , df_08.Country_B.count())
print ("Unique Product ",   df_08.Product.nunique(),   " out of " , df_08.Product.count())
print ("Unique Cell_On_Site ", df_08.Cell_On_Site.nunique(), " out of " , df_08.Cell_On_Site.count())
print ("Unique Site_ID ", df_08.Site_ID.nunique(), " out of " , df_08.Site_ID.count())
print ("Unique Cell_ID ", df_08.Cell_ID.nunique(), " out of " , df_08.Cell_ID.count())
print ("Unique Party_A_Number ", df_08.Party_A_Number.nunique(), " out of " , df_08.Party_A_Number.count())
print ("Unique Party_B_Number ", df_08.Party_B_Number.nunique(), " out of " , df_08.Party_B_Number.count())

08 Dataset
Unique Country_A  1  out of  5000
Unique Country_B  2  out of  5000
Unique Product  3  out of  5000
Unique Cell_On_Site  8  out of  5000
Unique Site_ID  1027  out of  4324
Unique Cell_ID  1661  out of  5000
Unique Party_A_Number  3799  out of  5000
Unique Party_B_Number  2882  out of  5000

In [17]:
#getting the unique values of the 09 dataset
print("09 Dataset")
print ("Unique Country_A ", df_09.Country_A.nunique(), " out of " , df_09.Country_A.count())
print ("Unique Country_B ", df_09.Country_B.nunique(), " out of " , df_09.Country_B.count())
print ("Unique Product ",   df_09.Product.nunique(),   " out of " , df_09.Product.count())
print ("Unique Cell_On_Site ", df_09.Cell_On_Site.nunique(), " out of " , df_09.Cell_On_Site.count())
print ("Unique Site_ID ", df_09.Site_ID.nunique(), " out of " , df_09.Site_ID.count())
print ("Unique Cell_ID ", df_09.Cell_ID.nunique(), " out of " , df_09.Cell_ID.count())
print ("Unique Party_A_Number ", df_09.Party_A_Number.nunique(), " out of " , df_09.Party_A_Number.count())
print ("Unique Party_B_Number ", df_09.Party_B_Number.nunique(), " out of " , df_09.Party_B_Number.count())

09 Dataset
Unique Country_A  1  out of  5000
Unique Country_B  2  out of  5000
Unique Product  3  out of  5000
Unique Cell_On_Site  9  out of  5000
Unique Site_ID  961  out of  4395
Unique Cell_ID  1596  out of  5000
Unique Party_A_Number  3593  out of  5000
Unique Party_B_Number  2895  out of  5000

In [18]:
#getting the data from dataset in 07
df_07.head()

  Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [19]:
#checking for duplicates in 07
print(df_07[df_07.duplicated(keep=False)])

     Product  Value              Date_Time  ... Country_B     Cell_ID     Site_ID
765      sms      0  2012-05-07 00:00:03.0  ...     19e2e  23c5372bd3  e942f32a29
769      sms     25  2012-05-07 00:00:03.0  ...     19e2e  a6606f4ac1  c6400e443f
793      sms      0  2012-05-07 00:00:03.0  ...     19e2e  23c5372bd3  e942f32a29
794      sms     25  2012-05-07 00:00:03.0  ...     19e2e  a6606f4ac1  c6400e443f
795    Voice      0  2012-05-07 00:00:04.0  ...     19e2e  4a7047f1ba  dea1e52d3b
...      ...    ...                    ...  ...       ...         ...         ...
4864   Voice   1610  2012-05-07 00:01:50.0  ...     19e2e  89b82605a0  5324bc6c24
4932   Voice      0  2012-05-07 00:01:52.0  ...     19e2e  d6abb7e15f  f72cd95f00
4943   Voice      0  2012-05-07 00:01:52.0  ...     19e2e  d6abb7e15f  f72cd95f00
4944   Voice     60  2012-05-07 00:01:53.0  ...     19e2e  fd754bd0d0  e82c07d996
4970   Voice     60  2012-05-07 00:01:53.0  ...     19e2e  fd754bd0d0  e82c07d996

[164 rows x 10 columns]

In [20]:
#combining the CDR datasets
df_cdr = pd.concat([df_07,df_08,df_09], axis=0)
df_cdr.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15001 entries, 0 to 4999
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product         15001 non-null  object
 1   Value           15001 non-null  int64
 2   Date_Time       15001 non-null  object
 3   Cell_On_Site    15001 non-null  object
 4   Party_A_Number  15001 non-null  object
 5   Party_B_Number  15001 non-null  object
 6   Country_A       15001 non-null  object
 7   Country_B       15001 non-null  object
 8   Cell_ID         15001 non-null  object
 9   Site_ID         13004 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.3+ MB

In [21]:
#changing the data types of the date columns which are storing date values to date for ease calculation
df_cdr['Date_Time'] = pd.to_datetime(df_cdr['Date_Time'])
df_cdr.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15001 entries, 0 to 4999
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product         15001 non-null  object
 1   Value           15001 non-null  int64
 2   Date_Time       15001 non-null  datetime64[ns]
 3   Cell_On_Site    15001 non-null  object
 4   Party_A_Number  15001 non-null  object
 5   Party_B_Number  15001 non-null  object
 6   Country_A       15001 non-null  object
 7   Country_B       15001 non-null  object
 8   Cell_ID         15001 non-null  object
 9   Site_ID         13004 non-null  object
dtypes: datetime64[ns](1), int64(1), object(8)
memory usage: 1.3+ MB

In [22]:
#deleting some columns that we do not require
df_cdr.drop(['Country_A', 'Country_B'], axis=1)

     Product  Value  ...     Cell_ID     Site_ID
0      Voice      0  ...  /TJNe+Mmtu  /TJNe+Mmtu
1        sms      0  ...  /+cKZKIp41  /+cKZKIp41
2        sms     25  ...  /u0FSD+ahi  /u0FSD+ahi
3      Voice     56  ...  +cNeJzsTp3  +cNeJzsTp3
4      Voice     14  ...  051KhYDCpv  051KhYDCpv
...      ...    ...  ...         ...         ...
4995   Voice      0  ...  2aa04dcab7  f7d63a29e5
4996   Voice     62  ...  7f1f2f889f  b4ddb9e93c
4997   Voice     32  ...  a4731e780e  d68260ef50
4998   Voice     30  ...  98ed726da2  b4130b54ab
4999   Voice     60  ...  1c11a2fcbb  6d70dae094

[15001 rows x 8 columns]

In [23]:
#deleting duplicates
df_cdr = df_cdr.drop_duplicates()
df_cdr.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14748 entries, 0 to 4999
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product         14748 non-null  object
 1   Value           14748 non-null  int64
 2   Date_Time       14748 non-null  datetime64[ns]
 3   Cell_On_Site    14748 non-null  object
 4   Party_A_Number  14748 non-null  object
 5   Party_B_Number  14748 non-null  object
 6   Country_A       14748 non-null  object
 7   Country_B       14748 non-null  object
 8   Cell_ID         14748 non-null  object
 9   Site_ID         12787 non-null  object
dtypes: datetime64[ns](1), int64(1), object(8)
memory usage: 1.2+ MB

In [24]:
#merging CDR and cell data

df_cdr_cells = pd.merge(df_cdr,df_cells, how='inner', on=['Cell_ID'])
df_cdr_cells.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Data columns (total 20 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Product            0 non-null      object
 1   Value              0 non-null      int64
 2   Date_Time          0 non-null      datetime64[ns]
 3   Cell_On_Site       0 non-null      object
 4   Party_A_Number     0 non-null      object
 5   Party_B_Number     0 non-null      object
 6   Country_A          0 non-null      object
 7   Country_B          0 non-null      object
 8   Cell_ID            0 non-null      object
 9   Site_ID_x          0 non-null      object
 10  City               0 non-null      object
 11  Status             0 non-null      object
 12  Locality           0 non-null      object
 13  Geographical_Zone  0 non-null      object
 14  Zone_Name          0 non-null      object
 15  Longitude          0 non-null      float64
 16  Latitude           0 non-null      float64
 17  Region             0 non-null      object
 18  Area               0 non-null      object
 19  Site_ID_y          0 non-null      object
dtypes: datetime64[ns](1), float64(2), int64(1), object(16)
memory usage: 0.0+ bytes

In [25]:
#city with most calls over the past 3 days
#we will count the number of calls per city and the one with the maximum number is the most used city
df_cdr.groupby('Cell_ID').count().nlargest(5,'Product')

            Product  Value  Date_Time  ...  Country_A  Country_B  Site_ID
Cell_ID                                ...
ffa6759bb2     1960   1960       1960  ...       1960       1960        0
03ee801971       73     73         73  ...         73         73       73
cc7ce19d6b       65     65         65  ...         65         65       65
b78724d6fc       42     42         42  ...         42         42       42
d22224b2fa       40     40         40  ...         40         40       40

[5 rows x 9 columns]

In [26]:
#cities that were mostly used between business days and home days
df_cdr.groupby('Product')['Value'].sum()

Product
Voice    306655
data      17285
sms       52377
Name: Value, dtype: int64

In [27]:
#busiest time of the day
#cell with the most income
df_cdr.groupby('Site_ID')['Value'].sum()

Site_ID
++ctND+jGD    134
+38u2u/rfx    186
+854AcBQT2    154
+Fs4mTvdKx     31
+QZ9qRtNxA     55
             ...
feffc8c92b    297
ff1b78ec81    322
ffa6bdc032    499
ffc9f56819    177
fff5ac6e3f     28
Name: Value, Length: 1357, dtype: int64